# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.
# 4 -> 1 2 3 4
# 9

import random

bushes = [random.randint(1,15) for _ in range(10)]

print(bushes)

max_berries = 0
for i in range(len(bushes)):
    total = bushes[i-2] + bushes[i-1] + bushes[i]
    if total > max_berries:
        max_berries = total
print(max_berries)

# print(max_berries)
#
# arr = [5, 8, 6, 4, 9, 8, 7, 7]
# max_get = arr[0] + arr[1] + arr[2]
# for i in range(1, len(arr), 1):
#     if i + 2 < len(arr) and arr[i] + arr[i + 1] + arr[i + 2] > max_get:
#         max_get = arr[i] + arr[i + 1] + arr[i+2]
# print(max_get)